app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "first post"], ["text", "I love ruby."], ["created_at", "2020-09-08 00:05:14.501529"], ["updated_at", "2020-09-08 00:05:14.501529"]]